TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
/** @enum DL_I2C_CONTROLLER_ACK */
typedef enum {
    /*!  Last received data byte of a transaction is not ACKed automatically */
    DL_I2C_CONTROLLER_ACK_ENABLE = I2C_MCTR_ACK_ENABLE,
    /*!  Last received data byte of a transaction is ACKed automatically */
    DL_I2C_CONTROLLER_ACK_DISABLE = I2C_MCTR_ACK_DISABLE,
} DL_I2C_CONTROLLER_ACK;

/** @enum DL_I2C_TX_FIFO_LEVEL */
typedef enum {
    /*!  Trigger when the TX FIFO is empty */
    DL_I2C_TX_FIFO_LEVEL_EMPTY = I2C_MFIFOCTL_TXTRIG_EMPTY,
    /*!  Trigger when TX FIFO contains 1 byte */
    DL_I2C_TX_FIFO_LEVEL_BYTES_1 = I2C_MFIFOCTL_TXTRIG_LEVEL_1,
    /*!  Trigger when TX FIFO contains 2 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_2 = I2C_MFIFOCTL_TXTRIG_LEVEL_2,
    /*!  Trigger when TX FIFO contains 3 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_3 = I2C_MFIFOCTL_TXTRIG_LEVEL_3,
    /*!  Trigger when TX FIFO contains 4 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_4 = I2C_MFIFOCTL_TXTRIG_LEVEL_4,
    /*!  Trigger when TX FIFO contains 5 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_5 = I2C_MFIFOCTL_TXTRIG_LEVEL_5,
    /*!  Trigger when TX FIFO contains 6 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_6 = I2C_MFIFOCTL_TXTRIG_LEVEL_6,
    /*!  Trigger when TX FIFO contains 7 bytes */
    DL_I2C_TX_FIFO_LEVEL_BYTES_7 = I2C_MFIFOCTL_TXTRIG_LEVEL_7,
} DL_I2C_TX_FIFO_LEVEL;

/** @enum DL_I2C_RX_FIFO_LEVEL */
typedef enum {
    /*!  Trigger when RX FIFO contains at least 1 byte */
    DL_I2C_RX_FIFO_LEVEL_BYTES_1 = I2C_MFIFOCTL_RXTRIG_LEVEL_1,
    /*!  Trigger when RX FIFO contains at least 2 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_2 = I2C_MFIFOCTL_RXTRIG_LEVEL_2,
    /*!  Trigger when RX FIFO contains at least 3 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_3 = I2C_MFIFOCTL_RXTRIG_LEVEL_3,
    /*!  Trigger when RX FIFO contains at least 4 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_4 = I2C_MFIFOCTL_RXTRIG_LEVEL_4,
    /*!  Trigger when RX FIFO contains at least 5 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_5 = I2C_MFIFOCTL_RXTRIG_LEVEL_5,
    /*!  Trigger when RX FIFO contains at least 6 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_6 = I2C_MFIFOCTL_RXTRIG_LEVEL_6,
    /*!  Trigger when RX FIFO contains at least 7 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_7 = I2C_MFIFOCTL_RXTRIG_LEVEL_7,
    /*!  Trigger when RX FIFO contains at least 8 bytes */
    DL_I2C_RX_FIFO_LEVEL_BYTES_8 = I2C_MFIFOCTL_RXTRIG_LEVEL_8,
} DL_I2C_RX_FIFO_LEVEL;

/** @enum DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE */
typedef enum {
    /*!  Target manual ACK for valid data or command.  */
    DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK = I2C_SACKCTL_ACKOVAL_DISABLE,
    /*!  Target manual NACK for invalid data or command.  */
    DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK = I2C_SACKCTL_ACKOVAL_ENABLE,
} DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE;

/*! @enum DL_I2C_IIDX */
typedef enum {
    /*! Interrupt index for I2C if no interrupt is pending */
    DL_I2C_IIDX_NO_INT = I2C_CPU_INT_IIDX_STAT_NO_INTR,
    /*! Interrupt index for I2C Controller Receive Transaction completed */
    DL_I2C_IIDX_CONTROLLER_RX_DONE = I2C_CPU_INT_IIDX_STAT_MRXDONEFG,
    /*! Interrupt index for Controller Transmit Transaction completed */
    DL_I2C_IIDX_CONTROLLER_TX_DONE = I2C_CPU_INT_IIDX_STAT_MTXDONEFG,
    /*! Interrupt index for I2C Controller Receive FIFO Trigger */
    DL_I2C_IIDX_CONTROLLER_RXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_MRXFIFOTRG,
    /*! Interrupt index for I2C Controller Transmit FIFO Trigger */
    DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_MTXFIFOTRG,
    /*! Interrupt index for I2C Controller Receive when FIFO is full */
    DL_I2C_IIDX_CONTROLLER_RXFIFO_FULL = I2C_CPU_INT_IIDX_STAT_MRXFIFOFULL,
    /*! Interrupt index for I2C Controller when Transmit FIFO is empty */
    DL_I2C_IIDX_CONTROLLER_TXFIFO_EMPTY = I2C_CPU_INT_IIDX_STAT_MTX_EMPTY,
    /*! Interrupt index for Address/Data NACK */
    DL_I2C_IIDX_CONTROLLER_NACK = I2C_CPU_INT_IIDX_STAT_MNACKFG,
    /*! Interrupt index for I2C controller START Detection */
    DL_I2C_IIDX_CONTROLLER_START = I2C_CPU_INT_IIDX_STAT_MSTARTFG,
    /*! Interrupt index for I2C controller STOP Detection */
    DL_I2C_IIDX_CONTROLLER_STOP = I2C_CPU_INT_IIDX_STAT_MSTOPFG,
    /*! Interrupt index for I2C controller Arbitration Lost */
    DL_I2C_IIDX_CONTROLLER_ARBITRATION_LOST = I2C_CPU_INT_IIDX_STAT_MARBLOSTFG,
    /*! Interrupt index for I2C controller Event 1 DMA Done */
    DL_I2C_IIDX_CONTROLLER_EVENT1_DMA_DONE =
        I2C_CPU_INT_IIDX_STAT_MDMA_DONE_TX,
    /*! Interrupt index for I2C controller Event 2 DMA Done */
    DL_I2C_IIDX_CONTROLLER_EVENT2_DMA_DONE =
        I2C_CPU_INT_IIDX_STAT_MDMA_DONE_RX,

    /*! Interrupt index for I2C controller SMBus/PMBus PEC Receive Error Event */
    DL_I2C_IIDX_CONTROLLER_PEC_RX_ERROR = I2C_CPU_INT_IIDX_STAT_MPEC_RX_ERR,
    /*! Interrupt index for I2C Timeout A Event */
    DL_I2C_IIDX_TIMEOUT_A = I2C_CPU_INT_IIDX_STAT_TIMEOUTA,
    /*! Interrupt index for I2C Timeout B Event */
    DL_I2C_IIDX_TIMEOUT_B = I2C_CPU_INT_IIDX_STAT_TIMEOUTB,

    /*! Interrupt index for I2C Target Receive Data */
    DL_I2C_IIDX_TARGET_RX_DONE = I2C_CPU_INT_IIDX_STAT_SRXDONEFG,
    /*! Interrupt index for I2C Target Transmit Transaction completed */
    DL_I2C_IIDX_TARGET_TX_DONE = I2C_CPU_INT_IIDX_STAT_STXDONEFG,
    /*! Interrupt index for I2C Target Receive FIFO Trigger */
    DL_I2C_IIDX_TARGET_RXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_SRXFIFOTRG,
    /*! Interrupt index for I2C Target Transmit FIFO Trigger */
    DL_I2C_IIDX_TARGET_TXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_STXFIFOTRG,
    /*! Interrupt index for I2C Target RX FIFO full */
    DL_I2C_IIDX_TARGET_RXFIFO_FULL = I2C_CPU_INT_IIDX_STAT_SRXFIFOFULL,
    /*! Interrupt index for I2C Target TX FIFO empty.
     * All data in Transmit FIFO shifted out and transmit goes into idle mode. */
    DL_I2C_IIDX_TARGET_TXFIFO_EMPTY = I2C_CPU_INT_IIDX_STAT_STXEMPTY,
    /*! Interrupt index for I2C Target Start Condition detected */
    DL_I2C_IIDX_TARGET_START = I2C_CPU_INT_IIDX_STAT_SSTARTFG,
    /*! Interrupt index for I2C Target Stop Condition detected */
    DL_I2C_IIDX_TARGET_STOP = I2C_CPU_INT_IIDX_STAT_SSTOPFG,
    /*! Interrupt index for I2C General Call */
    DL_I2C_IIDX_TARGET_GENERAL_CALL = I2C_CPU_INT_IIDX_STAT_SGENCALL,
    /*! Interrupt index for I2C Target Event 1 DMA Done */
    DL_I2C_IIDX_TARGET_EVENT1_DMA_DONE = I2C_CPU_INT_IIDX_STAT_SDMA_DONE_TX,
    /*! Interrupt index for I2C Target Event 2 DMA Done */
    DL_I2C_IIDX_TARGET_EVENT2_DMA_DONE = I2C_CPU_INT_IIDX_STAT_SDMA_DONE_RX,

    /*! Interrupt index for I2C Target SMBus/PMBus PEC Receive Error Event */
    DL_I2C_IIDX_TARGET_PEC_RX_ERROR = I2C_CPU_INT_IIDX_STAT_SPEC_RX_ERR,
    /*! Interrupt index for I2C Target TX FIFO underflow event */
    DL_I2C_IIDX_TARGET_TXFIFO_UNDERFLOW = I2C_CPU_INT_IIDX_STAT_STX_UNFL,
    /*! Interrupt index for I2C Target RX FIFO overflow event */
    DL_I2C_IIDX_TARGET_RXFIFO_OVERFLOW = I2C_CPU_INT_IIDX_STAT_SRX_OVFL,
    /*! Interrupt index for I2C Target arbitration lost event */
    DL_I2C_IIDX_TARGET_ARBITRATION_LOST = I2C_CPU_INT_IIDX_STAT_SARBLOST,
    /*! Interrupt index for I2C interrupt overflow event */
    DL_I2C_IIDX_INTERRUPT_OVERFLOW = I2C_CPU_INT_IIDX_STAT_INTR_OVFL,

} DL_I2C_IIDX;

/**
 * @brief  Configuration struct for @ref DL_I2C_setClockConfig.
 */
typedef struct {
    /*! I2C module clock source. One of @ref DL_I2C_CLOCK */
    DL_I2C_CLOCK clockSel;
    /*! I2C clock divider selection. One of @ref DL_I2C_CLOCK_DIVIDE */
    DL_I2C_CLOCK_DIVIDE divideRatio;
} DL_I2C_ClockConfig;

/**
 *  @brief      Configure I2C source clock
 *
 *  @param[in]  i2c    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                       @ref DL_I2C_ClockConfig.
 */
void DL_I2C_setClockConfig(I2C_Regs *i2c, DL_I2C_ClockConfig *config);

/**
 *  @brief      Get I2C source clock configuration
 *
 *  @param[in]  i2c    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_I2C_ClockConfig.
 */
void DL_I2C_getClockConfig(I2C_Regs *i2c, DL_I2C_ClockConfig *config);

/**
 *  @brief      Fills the controller TX FIFO with data
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to buffer of bytes
 *  @param[in]  count   Number of bytes to fill controller TX FIFO from buffer
 *
 *  @return     Number of bytes that were successfully written
 */
uint16_t DL_I2C_fillControllerTXFIFO(
    I2C_Regs *i2c, uint8_t *buffer, uint16_t count);

/**
 *  @brief      Flushes/removes all elements in the controller TX FIFO
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
void DL_I2C_flushControllerTXFIFO(I2C_Regs *i2c);

/**
 *  @brief      Flushes/removes all elements in the controller RX FIFO
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
void DL_I2C_flushControllerRXFIFO(I2C_Regs *i2c);

/**
 *  @brief      Checks if controller TX FIFO is full
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller TX FIFO is full
 *
 *  @retval     true if controller TX FIFO is full
 *  @retval     false if controller TX FIFO is not full
 */
__STATIC_INLINE bool DL_I2C_isControllerTXFIFOFull(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) ==
            I2C_MFIFOSR_TXFIFOCNT_MINIMUM);
}

/**
 *  @brief      Checks if controller TX FIFO is empty
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller TX FIFO is empty
 *
 *  @retval     true if controller TX FIFO is empty
 *  @retval     false if controller TX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2C_isControllerTXFIFOEmpty(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) ==
            I2C_MFIFOSR_TXFIFOCNT_MAXIMUM);
}

/**
 *  @brief      Checks if controller RX FIFO is empty
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller RX FIFO is empty
 *
 *  @retval     true if controller RX FIFO is empty
 *  @retval     false if controller RX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2C_isControllerRXFIFOEmpty(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFIFOCNT_MASK) ==
            I2C_MFIFOSR_RXFIFOCNT_MINIMUM);
}

/**
 *  @brief      Reset transfers from from I2C controller
 *
 *  Resets transfer register to initialize I2C
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_resetControllerTransfer(I2C_Regs *i2c)
{
    // Resets all Controller functionality
    i2c->MASTER.MCTR = 0x00;
}

/**
 *  @brief      Sets up a transfer from I2C controller
 *
 *  Set target address, transfer direction, burst length, START+STOP generation.
 *  @note   Reading/writing data must be done separately.
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddr  Target address [0x00, 0x3FF]
 *  @param[in]  direction   One of @ref DL_I2C_CONTROLLER_DIRECTION
 *  @param[in]  length      Intended burst length in number of bytes
 */
__STATIC_INLINE void DL_I2C_startControllerTransfer(I2C_Regs *i2c,
    uint32_t targetAddr, DL_I2C_CONTROLLER_DIRECTION direction,
    uint16_t length)
{
    // Specify target address and read/write mode
    DL_Common_updateReg(&i2c->MASTER.MSA,
        ((targetAddr << I2C_MSA_SADDR_OFS) | (uint32_t) direction),
        (I2C_MSA_SADDR_MASK | I2C_MSA_DIR_MASK));

    // STOP bit is generated after burst length number of bytes transferred
    DL_Common_updateReg(&i2c->MASTER.MCTR,
        (((uint32_t) length << I2C_MCTR_MBLEN_OFS) | I2C_MCTR_BURSTRUN_ENABLE |
            I2C_MCTR_START_ENABLE | I2C_MCTR_STOP_ENABLE),
        (I2C_MCTR_MBLEN_MASK | I2C_MCTR_BURSTRUN_MASK | I2C_MCTR_START_MASK |
            I2C_MCTR_STOP_MASK));
}

/**
 *  @brief      Sets up a transfer from I2C controller with control of START,
 *  STOP and ACK
 *
 *  @note   Reading/writing data must be done separately.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  targetAddr  7-bit target address [0x00, 0x7f]
 *  @param[in]  direction   One of @ref DL_I2C_CONTROLLER_DIRECTION
 *  @param[in]  length      Intended burst length in number of bytes
 *  @param[in]  start       One of @ref DL_I2C_CONTROLLER_START
 *  @param[in]  stop        One of @ref DL_I2C_CONTROLLER_STOP
 *  @param[in]  ack         One of @ref DL_I2C_CONTROLLER_ACK
 */
__STATIC_INLINE void DL_I2C_startControllerTransferAdvanced(I2C_Regs *i2c,
    uint32_t targetAddr, DL_I2C_CONTROLLER_DIRECTION direction,
    uint16_t length, DL_I2C_CONTROLLER_START start,
    DL_I2C_CONTROLLER_STOP stop, DL_I2C_CONTROLLER_ACK ack)
{
    // Specify target address and read/write mode
    DL_Common_updateReg(&i2c->MASTER.MSA,
        ((targetAddr << I2C_MSA_SADDR_OFS) | (uint32_t) direction),
        (I2C_MSA_SADDR_MASK | I2C_MSA_DIR_MASK));

    DL_Common_updateReg(&i2c->MASTER.MCTR,
        (((uint32_t) length << I2C_MCTR_MBLEN_OFS) | I2C_MCTR_BURSTRUN_ENABLE |
            (uint32_t) start | (uint32_t) stop | (uint32_t) ack),
        (I2C_MCTR_MBLEN_MASK | I2C_MCTR_BURSTRUN_MASK | I2C_MCTR_START_MASK |
            I2C_MCTR_STOP_MASK | I2C_MCTR_ACK_MASK));
}

/**
 *  @brief      Checks if target TX FIFO is full
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target TX FIFO is full
 *
 *  @retval     true if target TX FIFO is full
 *  @retval     false if target TX FIFO is not full
 */
__STATIC_INLINE bool DL_I2C_isTargetTXFIFOFull(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) ==
            I2C_SFIFOSR_TXFIFOCNT_MINIMUM);
}

/**
 *  @brief      Checks if target TX FIFO is empty
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target TX FIFO is empty
 *
 *  @retval     true if target TX FIFO is empty
 *  @retval     false if target TX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2C_isTargetTXFIFOEmpty(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) ==
            I2C_SFIFOSR_TXFIFOCNT_MAXIMUM);
}

/**
 *  @brief      Checks if target RX FIFO is empty
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target RX FIFO is empty
 *
 *  @retval     true if target RX FIFO is empty
 *  @retval     false if target RX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2C_isTargetRXFIFOEmpty(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFIFOCNT_MASK) ==
            I2C_SFIFOSR_RXFIFOCNT_MINIMUM);
}

/**
 *  @brief      Fills the target TX FIFO with data
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to buffer of bytes
 *  @param[in]  count   Number of bytes to fill target TX FIFO from buffer
 *
 *  @return     Number of bytes that were successfully written
 */
uint8_t DL_I2C_fillTargetTXFIFO(I2C_Regs *i2c, uint8_t *buffer, uint8_t count);

/**
 *  @brief      Flushes/removes all elements in the target TX FIFO
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
void DL_I2C_flushTargetTXFIFO(I2C_Regs *i2c);

/**
 *  @brief      Flushes/removes all elements in the target RX FIFO
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
void DL_I2C_flushTargetRXFIFO(I2C_Regs *i2c);

/**
 *  @brief  Transmit target data, waiting until transmit request
 *
 *  @note   Setting own target addresses and enabling target should be done
 *  separately.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Byte of data to transmit
 */
void DL_I2C_transmitTargetDataBlocking(I2C_Regs *i2c, uint8_t data);

/**
 *  @brief  Transmit target data
 *
 *  @note   Setting own target addresses and enabling target should be done
 *  separately.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Byte of data to transmit
 *
 *  @return Whether data could be transmitted or not
 *  @retval true if data could be transmitted
 *  @retval false if data could not be transmitted
 */
bool DL_I2C_transmitTargetDataCheck(I2C_Regs *i2c, uint8_t data);

/**
 *  @brief  Receive target data, waiting until receive request
 *
 *  @note   Setting own target addresses and enabling target should be done
 *  separately.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return Data received from target
 */
uint8_t DL_I2C_receiveTargetDataBlocking(I2C_Regs *i2c);

/**
 *  @brief  Receive target data
 *
 *  @note   Setting own target addresses and enabling target should be done
 *  separately.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to where byte of received data should be stored
 *
 *  @return Whether data could be received or not
 *  @retval true if data could be received
 *  @retval false if data could not be received
 */
bool DL_I2C_receiveTargetDataCheck(I2C_Regs *i2c, uint8_t *buffer);

/**
 * @brief Enables power on I2C module
 *
 * @param i2c        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enablePower(I2C_Regs *i2c)
{
    i2c->GPRCM.PWREN = (I2C_PWREN_KEY_UNLOCK_W | I2C_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on i2c module
 *
 * @param i2c        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disablePower(I2C_Regs *i2c)
{
    i2c->GPRCM.PWREN = (I2C_PWREN_KEY_UNLOCK_W | I2C_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if  power on i2c module
 *
 * @param i2c        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_I2C_isPowerEnabled(I2C_Regs *i2c)
{
    return (
        (i2c->GPRCM.PWREN & I2C_PWREN_ENABLE_MASK) == I2C_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets i2c peripheral
 *
 * @param i2c        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_reset(I2C_Regs *i2c)
{
    i2c->GPRCM.RSTCTL =
        (I2C_RSTCTL_KEY_UNLOCK_W | I2C_RSTCTL_RESETSTKYCLR_CLR |
            I2C_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if i2c peripheral was reset
 *
 * @param i2c        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_I2C_isReset(I2C_Regs *i2c)
{
    return ((i2c->GPRCM.STAT & I2C_STAT_RESETSTKY_MASK) ==
            I2C_STAT_RESETSTKY_RESET);
}

/**
 * @brief Set Clock Source
 *
 *  Clock sources depend on device and clock should be enabled
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockSource    One of @ref DL_I2C_CLOCK.
 *
 */
__STATIC_INLINE void DL_I2C_selectClockSource(
    I2C_Regs *i2c, DL_I2C_CLOCK clockSource)
{
    DL_Common_updateReg(&i2c->CLKSEL, (uint32_t) clockSource,
        I2C_CLKSEL_BUSCLK_SEL_MASK | I2C_CLKSEL_MFCLK_SEL_MASK);
}

/**
 * @brief Set Clock Divider
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockDivider   One of @ref DL_I2C_CLOCK_DIVIDE.
 *
 */
__STATIC_INLINE void DL_I2C_selectClockDivider(
    I2C_Regs *i2c, DL_I2C_CLOCK_DIVIDE clockDivider)
{
    DL_Common_updateReg(
        &i2c->CLKDIV, (uint32_t) clockDivider, I2C_CLKDIV_RATIO_MASK);
}

/**
 *  @brief      Get Analog Glitch Suppression Pulse Width
 *
 *  Pulse width for the analog glitch suppression on SCL/SDA lines.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Analog glitch suppression pulse width
 *
 *  @retval     One of @ref DL_I2C_ANALOG_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE DL_I2C_ANALOG_GLITCH_FILTER_WIDTH
DL_I2C_getAnalogGlitchFilterPulseWidth(I2C_Regs *i2c)
{
    uint32_t filterWidth = i2c->GFCTL & I2C_GFCTL_AGFSEL_MASK;

    return (DL_I2C_ANALOG_GLITCH_FILTER_WIDTH)(filterWidth);
}

/**
 *  @brief      Set Analog Glitch Suppression Pulse Width
 *
 *  Pulse width for the analog glitch suppression on SCL/SDA lines.
 *
 *  @param[in]  i2c            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  filterWidth    One of @ref DL_I2C_ANALOG_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE void DL_I2C_setAnalogGlitchFilterPulseWidth(
    I2C_Regs *i2c, DL_I2C_ANALOG_GLITCH_FILTER_WIDTH filterWidth)
{
    DL_Common_updateReg(
        &i2c->GFCTL, (uint32_t) filterWidth, I2C_GFCTL_AGFSEL_MASK);
}

/**
 *  @brief      Get Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Digital glitch suppression pulse width
 *
 *  @retval     One of @ref DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH
DL_I2C_getDigitalGlitchFilterPulseWidth(I2C_Regs *i2c)
{
    uint32_t filterWidth = i2c->GFCTL & I2C_GFCTL_DGFSEL_MASK;

    return (DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH)(filterWidth);
}

/**
 *  @brief      Set Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  i2c             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  filterWidth     One of @ref DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE void DL_I2C_setDigitalGlitchFilterPulseWidth(
    I2C_Regs *i2c, DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH filterWidth)
{
    DL_Common_updateReg(
        &i2c->GFCTL, (uint32_t) filterWidth, I2C_GFCTL_DGFSEL_MASK);
}

/**
 *  @brief      Disable Analog Glitch Suppression
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableAnalogGlitchFilter(I2C_Regs *i2c)
{
    i2c->GFCTL &= ~(I2C_GFCTL_AGFEN_MASK);
}

/**
 *  @brief      Checks if analog glitch suppression is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If analog glitch suppression is enabled
 *
 *  @retval     true if analog glitch suppression is enabled
 *  @retval     false if analog glitch suppression is disabled
 */
__STATIC_INLINE bool DL_I2C_isAnalogGlitchFilterEnabled(I2C_Regs *i2c)
{
    return ((i2c->GFCTL & I2C_GFCTL_AGFEN_MASK) == I2C_GFCTL_AGFEN_ENABLE);
}

/**
 *  @brief      Enable Analog Glitch Suppression
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableAnalogGlitchFilter(I2C_Regs *i2c)
{
    i2c->GFCTL |= I2C_GFCTL_AGFEN_ENABLE;
}

/**
 *  @brief      Get direction of next controller operation
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Direction of next controller operation
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_DIRECTION
 */
__STATIC_INLINE DL_I2C_CONTROLLER_DIRECTION DL_I2C_getControllerDirection(
    I2C_Regs *i2c)
{
    uint32_t direction = i2c->MASTER.MSA & I2C_MSA_DIR_MASK;

    return (DL_I2C_CONTROLLER_DIRECTION)(direction);
}

