TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
    return (DL_I2C_CONTROLLER_SCL)(sclStatus);
}

/**
 *  @brief      Get SDA signal status
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of SDA signal
 *
 *  @retval     One of @ref DL_I2C_CONTROLLER_SDA
 */
__STATIC_INLINE DL_I2C_CONTROLLER_SDA DL_I2C_getSDAStatus(I2C_Regs *i2c)
{
    uint32_t sdaStatus = i2c->MASTER.MBMON & I2C_MBMON_SDA_MASK;

    return (DL_I2C_CONTROLLER_SDA)(sdaStatus);
}

/**
 *  @brief      Get controller TX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the TX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2C_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2C_TX_FIFO_LEVEL DL_I2C_getControllerTXFIFOThreshold(
    I2C_Regs *i2c)
{
    uint32_t level = i2c->MASTER.MFIFOCTL & I2C_MFIFOCTL_TXTRIG_MASK;

    return (DL_I2C_TX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set controller TX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2C_TX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2C_setControllerTXFIFOThreshold(
    I2C_Regs *i2c, DL_I2C_TX_FIFO_LEVEL level)
{
    DL_Common_updateReg(
        &i2c->MASTER.MFIFOCTL, (uint32_t) level, I2C_MFIFOCTL_TXTRIG_MASK);
}

/**
 *  @brief      Stop controller TX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2C_isControllerTXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_stopFlushControllerTXFIFO(I2C_Regs *i2c)
{
    i2c->MASTER.MFIFOCTL &= ~(I2C_MFIFOCTL_TXFLUSH_MASK);
}

/**
 *  @brief      Start controller TX FIFO flush
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_startFlushControllerTXFIFO(I2C_Regs *i2c)
{
    i2c->MASTER.MFIFOCTL |= I2C_MFIFOCTL_TXFLUSH_MASK;
}

/**
 *  @brief      Get controller RX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Indicates at what fill level in the RX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2C_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2C_RX_FIFO_LEVEL DL_I2C_getControllerRXFIFOThreshold(
    I2C_Regs *i2c)
{
    uint32_t level = i2c->MASTER.MFIFOCTL & I2C_MFIFOCTL_RXTRIG_MASK;

    return (DL_I2C_RX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set controller RX FIFO threshold level
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2C_RX_FIFO_LEVEL.
 */
__STATIC_INLINE void DL_I2C_setControllerRXFIFOThreshold(
    I2C_Regs *i2c, DL_I2C_RX_FIFO_LEVEL level)
{
    DL_Common_updateReg(
        &i2c->MASTER.MFIFOCTL, (uint32_t) level, I2C_MFIFOCTL_RXTRIG_MASK);
}

/**
 *  @brief      Stop controller RX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2C_isControllerRXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_stopFlushControllerRXFIFO(I2C_Regs *i2c)
{
    i2c->MASTER.MFIFOCTL &= ~(I2C_MFIFOCTL_RXFLUSH_MASK);
}

/**
 *  @brief      Start controller RX FIFO flush
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_startFlushControllerRXFIFO(I2C_Regs *i2c)
{
    i2c->MASTER.MFIFOCTL |= I2C_MFIFOCTL_RXFLUSH_MASK;
}

/**
 *  @brief      Get number of bytes which can be read from RX FIFO
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be read from RX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2C_getControllerRXFIFOCounter(I2C_Regs *i2c)
{
    return (i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFIFOCNT_MASK);
}

/**
 *  @brief      Get number of bytes which can be put into TX FIFO
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Number of bytes which can be put into TX FIFO
 *
 *  @retval     [0x0, 0x8]
 */
__STATIC_INLINE uint32_t DL_I2C_getControllerTXFIFOCounter(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) >>
            I2C_MFIFOSR_TXFIFOCNT_OFS);
}

/**
 *  @brief      Checks if controller RX FIFO flush is active
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller RX FIFO flush is active
 *
 *  @retval     true if controller RX FIFO flush is active
 *  @retval     false if controller RX FIFO flush is not active
 */
__STATIC_INLINE bool DL_I2C_isControllerRXFIFOFlushActive(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFLUSH_MASK) ==
            I2C_MFIFOSR_RXFLUSH_ACTIVE);
}

/**
 *  @brief      Checks if controller TX FIFO flush is active
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If controller TX FIFO flush is active
 *
 *  @retval     true if controller TX FIFO flush is active
 *  @retval     false if controller TX FIFO flush is not active
 */
__STATIC_INLINE bool DL_I2C_isControllerTXFIFOFlushActive(I2C_Regs *i2c)
{
    return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFLUSH_MASK) ==
            I2C_MFIFOSR_TXFLUSH_ACTIVE);
}

/**
 *  @brief      Set target own address
 *
 * This field specifies bits A9 through A0 of the target own address.
 *
 * In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
 * the top 3 bits are don't care
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  addr    Value of target own address [0x00, 0x3FF]
 */
__STATIC_INLINE void DL_I2C_setTargetOwnAddress(I2C_Regs *i2c, uint32_t addr)
{
    DL_Common_updateReg(&i2c->SLAVE.SOAR, addr, I2C_SOAR_OAR_MASK);
}

/**
 *  @brief      Get target own address
 *
 * Get bits A9 through A0 of the target own address.
 *
 * In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
 * the top 3 bits are don't care
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Target own address
 *
 *  @retval     [0x00, 0x3FF]
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetOwnAddress(I2C_Regs *i2c)
{
    return (i2c->SLAVE.SOAR & I2C_SOAR_OAR_MASK);
}

/**
 *  @brief      Enable target own address
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa DL_I2C_setTargetOwnAddress
 */
__STATIC_INLINE void DL_I2C_enableTargetOwnAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SOAR |= I2C_SOAR_OAREN_ENABLE;
}

/**
 *  @brief      Disable target own address
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetOwnAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SOAR &= ~(I2C_SOAR_OAREN_MASK);
}

/**
 *  @brief      Checks if target own address is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target own address is enabled
 *
 *  @retval     true if target own address is enabled
 *  @retval     false if target own address is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetOwnAddressEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SOAR & I2C_SOAR_OAREN_MASK) == I2C_SOAR_OAREN_ENABLE);
}

/**
 *  @brief      Set target addressing mode
 *
 *  Selects the addressing mode to be used when device is configured as a
 *  target
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  mode    Addressing mode to set the target to.
 *                      One of @ref DL_I2C_TARGET_ADDRESSING_MODE.
 */
__STATIC_INLINE void DL_I2C_setTargetAddressingMode(
    I2C_Regs *i2c, DL_I2C_TARGET_ADDRESSING_MODE mode)
{
    DL_Common_updateReg(
        &i2c->SLAVE.SOAR, (uint32_t) mode, I2C_SOAR_SMODE_MASK);
}

/**
 *  @brief      Get target addressing mode
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Addressing mode the target is set to
 *
 *  @retval     One of @ref DL_I2C_TARGET_ADDRESSING_MODE
 */
__STATIC_INLINE DL_I2C_TARGET_ADDRESSING_MODE DL_I2C_getTargetAddressingMode(
    I2C_Regs *i2c)
{
    uint32_t mode = i2c->SLAVE.SOAR & I2C_SOAR_SMODE_MASK;

    return (DL_I2C_TARGET_ADDRESSING_MODE)(mode);
}

/**
 *  @brief      Get target own address alternate
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @return     Target own address alternate
 *
 *  @retval     [0x00, 0x7f]
 */
__STATIC_INLINE uint32_t I2C_getTargetOwnAddressAlternate(I2C_Regs *i2c)
{
    return (i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2_MASK);
}

/**
 *  @brief      Set target own address alternate
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  addr    Value of target own address alternate [0x00, 0x7f]
 */
__STATIC_INLINE void DL_I2C_setTargetOwnAddressAlternate(
    I2C_Regs *i2c, uint32_t addr)
{
    DL_Common_updateReg(&i2c->SLAVE.SOAR2, addr, I2C_SOAR2_OAR2_MASK);
}

/**
 *  @brief      Get target own address alternate mask
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Which bits of the target address are matched
 *
 *  @retval     Bit mask with each bit corresponding to bits A6 through A0 of
 *              the target address. Value between [0x00, 0x7F]
 */
__STATIC_INLINE uint32_t I2C_getTargetOwnAddressAlternateMask(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2_MASK_MASK) >>
            I2C_SOAR2_OAR2_MASK_OFS);
}

/**
 *  @brief      Set target own address alternate mask
 *
 * This field specifies bits A6 through A0 of the target address. The bits with
 * a value of 1 in the SOAR2.OAR2_MASK field will make the corresponding
 * incoming address bits to match by default regardless of the value inside
 * SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a don't care.
 *
 *  @param[in]  i2c           Pointer to the register overlay for the peripheral
 *  @param[in]  addressMask   Bit mask of address bits to match.
 *                            Value between [0x00, 0x7F]
 */
__STATIC_INLINE void DL_I2C_setTargetOwnAddressAlternateMask(
    I2C_Regs *i2c, uint32_t addressMask)
{
    DL_Common_updateReg(&i2c->SLAVE.SOAR2,
        addressMask << I2C_SOAR2_OAR2_MASK_OFS, I2C_SOAR2_OAR2_MASK_MASK);
}

/**
 *  @brief      Disable usage of target own address alternate
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetOwnAddressAlternate(I2C_Regs *i2c)
{
    i2c->SLAVE.SOAR2 &= ~(I2C_SOAR2_OAR2EN_MASK);
}

/**
 *  @brief      Checks if target own address alternate is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target own address alternate is enabled
 *
 *  @retval     true if target own address alternate is enabled
 *  @retval     false if target own address alternate is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetOwnAddressAlternateEnabled(I2C_Regs *i2c)
{
    return (
        (i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2EN_MASK) == I2C_SOAR2_OAR2EN_ENABLE);
}

/**
 *  @brief      Enable usage of target own address alternate
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTargetOwnAddressAlternate(I2C_Regs *i2c)
{
    i2c->SLAVE.SOAR2 |= I2C_SOAR2_OAR2EN_ENABLE;
}

/**
 *  @brief      Get the address for which address match happened
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Matched Target address
 *
 *  @retval     Bit mask with each bit corresponding to the target address.
 *  Value between [0x00, 0x7F] in 7-bit mode, or [0x00, 0x3FF] in 10-bit mode.
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetAddressMatch(I2C_Regs *i2c)
{
    return (
        (i2c->SLAVE.SSR & I2C_SSR_ADDRMATCH_MASK) >> I2C_SSR_ADDRMATCH_OFS);
}

/**
 *  @brief      Disable target clock stretching
 *
 *  Clock stretching should be enabled to be compliant with I2C specification
 *  and the SCL will be stretched when data must be read or written from the
 *  FIFO. It can optionally be disabled if a controller does not support it or
 *  to achieve maximum I2C frequency; however the developer should ensure that
 *  the FIFO is written or read on time.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetClockStretching(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_SCLKSTRETCH_MASK);
}

/**
 *  @brief      Checks if target clock stretching is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target clock stretching is enabled
 *
 *  @retval     true if target clock stretching is enabled
 *  @retval     false if target clock stretching is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetClockStretchingEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_SCLKSTRETCH_MASK) ==
            I2C_SCTR_SCLKSTRETCH_ENABLE);
}

/**
 *  @brief      Enable target clock stretching
 *
 *  Clock stretching should be enabled to be compliant with I2C specification
 *  and the SCL will be stretched when data must be read or written from the
 *  FIFO. It can optionally be disabled if a controller does not support it or
 *  to achieve maximum I2C frequency; however the developer should ensure that
 *  the FIFO is written or read on time.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTargetClockStretching(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_SCLKSTRETCH_ENABLE;
}

/**
 *  @brief      Disable target TX empty interrupt on transmit request
 *
 * When disabled, RIS.STXEMPTY will be set when only the Target TX FIFO is
 * empty. This allows the STXEMPTY interrupt to be used to indicate that the
 * I2C bus is being clock stretched and that Target TX data is required.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa         DL_I2C_isTargetClockStretchEnabled
 */
__STATIC_INLINE void DL_I2C_disableTargetTXEmptyOnTXRequest(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXEMPTY_ON_TREQ_MASK);
}

/**
 *  @brief      Checks if target TX empty interrupt on transmit request is
 *              enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX empty interrupt on transmit request is enabled
 *
 *  @retval     true if TX empty interrupt on transmit request is enabled
 *  @retval     false if TX empty interrupt on transmit request disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetTXEmptyOnTXRequestEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_TXEMPTY_ON_TREQ_MASK) ==
            I2C_SCTR_TXEMPTY_ON_TREQ_ENABLE);
}

/**
 *  @brief      Enable target TX empty interrupt on transmit request
 *
 *  When enabled, RIS.STXEMPTY will be set when the Target state machine is in
 *  the TX_WAIT state which occurs when the TX FIFO is empty AND the I2C
 *  transaction is clock stretched waiting for the FIFO to receive data.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTargetTXEmptyOnTXRequest(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_TXEMPTY_ON_TREQ_ENABLE;
}

/**
 *  @brief      Disable target TX trigger in TX mode
 *
 * When disabled, RIS.TXFIFOTRG will only be set when the Target TX FIFO is at
 * or above the trigger level.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetTXTriggerInTXMode(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXTRIG_TXMODE_MASK);
}

/**
 *  @brief      Checks if target TX trigger in TX mode is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target TX trigger in TX mode is enabled
 *
 *  @retval     true if target TX trigger in TX mode is enabled
 *  @retval     false if target TX trigger in TX mode is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetTXTriggerInTXModeEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_TXTRIG_TXMODE_MASK) ==
            I2C_SCTR_TXTRIG_TXMODE_ENABLE);
}

/**
 *  @brief      Enable TX trigger when target is in TX mode
 *
 *  When enabled, RIS.TXFIFOTRG will be set when the Target TX FIFO has reached
 *  the trigger level AND the Target state machine is in the TXMODE as defined
 *  in the SSR register. When cleared RIS.TXFIFOTRG will be set when the Target
 *  TX FIFO is at or above the trigger level. This setting can be used to hold
 *  off the TX DMA until a transaction starts. This allows the DMA to be
 *  configured when the I2C is idle but have it wait till the transaction
 *  starts to load the Target TX FIFO, so it can load from a memory buffer that
 *  might be changing over time.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER
 */
__STATIC_INLINE void DL_I2C_enableTargetTXTriggerInTXMode(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_TXTRIG_TXMODE_ENABLE;
}

/**
 *  @brief      Disable target TX transfer waits when stale data in TX FIFO
 *
 *  When disabled, the TX FIFO empty signal to the Target state machine
 *  indicates that the TX FIFO is empty.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetTXWaitWhenTXFIFOStale(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXWAIT_STALE_TXFIFO_MASK);
}

/**
 *  @brief      Checks if target TX transfer waits when stale data in TX FIFO
 *              is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target TX transfer waits when stale data in TX FIFO is
 *              enabled
 *
 *  @retval     true   if target TX transfer waits when stale data in TX FIFO
 *                     is enabled
 *  @retval     false  if target TX transfer waits when stale data in TX FIFO
 *                     is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetTXWaitWhenTXFIFOStaleEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_TXWAIT_STALE_TXFIFO_MASK) ==
            I2C_SCTR_TXWAIT_STALE_TXFIFO_ENABLE);
}

/**
 *  @brief      Enable target TX transfer waits when stale data in TX FIFO
 *
 *  When enabled, the TX FIFO empty signal to the Target state machine will
 *  indicate that the TX FIFO is empty or that the TX FIFO data is stale. The
 *  TX FIFO data is determined to be stale when there is data in the TX FIFO
 *  when the Target state machine leaves the TXMODE as defined in the SSR
 *  register. This can occur is a Stop or timeout occur when there are bytes
 *  left in the TX FIFO.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTargetTXWaitWhenTXFIFOStale(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_TXWAIT_STALE_TXFIFO_ENABLE;
}

/**
 *  @brief      Disable target RX full interrupt on receive request
 *
 *  When disabled, RIS.SRXFULL will be set when only the Target RX FIFO is
 *  full. This allows the SRXFULL interrupt to be used to indicate that the
 *  I2C bus is being clock stretched and that the FW must either read the RX
 *  FIFO or ACK/NACK the current RX byte.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa         DL_I2C_isTargetClockStretchEnabled
 */
__STATIC_INLINE void DL_I2C_disableTargetRXFullOnRXRequest(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_RXFULL_ON_RREQ_MASK);
}

/**
 *  @brief      Checks if target RX full interrupt on receive request is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target RX full interrupt on receive request enabled
 *
 *  @retval     true   if target RX full interrupt on receive request enabled
 *  @retval     false  if target RX full interrupt on receive request disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetRXFullOnRXRequestEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_RXFULL_ON_RREQ_MASK) ==
            I2C_SCTR_RXFULL_ON_RREQ_ENABLE);
}

/**
 *  @brief      Enable target RX full interrupt on receive request
 *
 *  When enabled, RIS.SRXFULL will be set when the Target state machine is in
 *  the RX_WAIT or RX_ACK_WAIT states which occurs when the I2C transaction is
 *  clock stretched because the RX FIFO is full or the ACKOEN has been set and
 *  the state machine is waiting for FW to ACK/NACK the current byte.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2C_enableTargetRXFullOnRXRequest(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_RXFULL_ON_RREQ_ENABLE;
}

/**
 *  @brief      Disable SMBus/PMBus default host address of 000 1000b
 *
 *  When disabled, the default host address is not matched.
 *  NOTE: The host address may still be matched if programmed as an own address.
 *    The I2C module can still be addressed as a target if enabled and own
 *  address match is enabled.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableDefaultHostAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_DEFHOSTADR_MASK);
}

/**
 *  @brief      Checks if SMBus/PMBus default host address of 000 1000b is
 *              enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If default host address is enabled
 *
 *  @retval     true   if default host address is enabled
 *  @retval     false  if default host address disabled
 */
__STATIC_INLINE bool DL_I2C_isDefaultHostAddressEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_DEFHOSTADR_MASK) ==
            I2C_SCTR_EN_DEFHOSTADR_ENABLE);
}

/**
 *  @brief      Enable SMBus/PMBus default host address of 000 1000b
 *
 *  When enabled, default host address of 0x0001000 is always matched by the
 *  target address match logic
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableDefaultHostAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_EN_DEFHOSTADR_ENABLE;
}

/**
 *  @brief      Disable SMBus/PMBus Alert response address (ARA) of 000 1100b
 *
 *  When disabled, the alert response address 0x0001100 is not matched.
 *  NOTE: The alert response address may still be matched if programmed as an
 *  own address.
 *    The I2C module can still be addressed as a target if enabled and own
 *  address match is enabled.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableAlertResponseAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_ALRESPADR_MASK);
}

/**
 *  @brief      Checks if SMBus/PMBus Alert response address (ARA) of 000 1100b
 * is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If alert response address is enabled
 *
 *  @retval     true   if alert response address is enabled
 *  @retval     false  if alert response address disabled
 */
__STATIC_INLINE bool DL_I2C_isAlertResponseAddressEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_ALRESPADR_MASK) ==
            I2C_SCTR_EN_ALRESPADR_ENABLE);
}

